H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
// Bright saturated colours cycled for neon outlines.
static const uint16_t NEON_HUES[] = {
    0xF800, 0xFD20, 0xFFE0, 0x07E0, 0x07FF, 0x041F, 0x781F, 0xF81F
};
static const uint8_t NEON_COUNT = 8;

// ─────────────────────────────────────────────────────────────────────────────
// Section metadata
// ─────────────────────────────────────────────────────────────────────────────
const uint8_t BibleInterface::SEC_BOOK_START[4]  = { 0, 22, 39, 49 };
const uint8_t BibleInterface::SEC_BOOK_COUNT_[4] = { 22, 17, 10, 27 };

const char* const BibleInterface::SEC_NAME_EN[4] = {
    "Old Testament", "Prophets", "Apocrypha", "New Testament"
};

// ─────────────────────────────────────────────────────────────────────────────
// Book table  { display name, OSIS code, chapter count, section }
// ─────────────────────────────────────────────────────────────────────────────
const BibleBook BibleInterface::BOOKS[BIBLE_BOOK_COUNT] = {
    // ── Old Testament (22) ─────────────────────────────────────────────
    { "Genesis",          "Gen",    50, BIBLE_SEC_OT },
    { "Exodus",           "Exod",   40, BIBLE_SEC_OT },
    { "Leviticus",        "Lev",    27, BIBLE_SEC_OT },
    { "Numbers",          "Num",    36, BIBLE_SEC_OT },
    { "Deuteronomy",      "Deut",   34, BIBLE_SEC_OT },
    { "Joshua",           "Josh",   24, BIBLE_SEC_OT },
    { "Judges",           "Judg",   21, BIBLE_SEC_OT },
    { "Ruth",             "Ruth",    4, BIBLE_SEC_OT },
    { "1 Samuel",         "1Sam",   31, BIBLE_SEC_OT },
    { "2 Samuel",         "2Sam",   24, BIBLE_SEC_OT },
    { "1 Kings",          "1Kgs",   22, BIBLE_SEC_OT },
    { "2 Kings",          "2Kgs",   25, BIBLE_SEC_OT },
    { "1 Chronicles",     "1Chr",   29, BIBLE_SEC_OT },
    { "2 Chronicles",     "2Chr",   36, BIBLE_SEC_OT },
    { "Ezra",             "Ezra",   10, BIBLE_SEC_OT },
    { "Nehemiah",         "Neh",    13, BIBLE_SEC_OT },
    { "Esther",           "Esth",   10, BIBLE_SEC_OT },
    { "Job",              "Job",    42, BIBLE_SEC_OT },
    { "Psalms",           "Ps",    150, BIBLE_SEC_OT },
    { "Proverbs",         "Prov",   31, BIBLE_SEC_OT },
    { "Ecclesiastes",     "Eccl",   12, BIBLE_SEC_OT },
    { "Song of Solomon",  "Song",    8, BIBLE_SEC_OT },
    // ── Prophets (17) ──────────────────────────────────────────────────
    { "Isaiah",           "Isa",    66, BIBLE_SEC_PR },
    { "Jeremiah",         "Jer",    52, BIBLE_SEC_PR },
    { "Lamentations",     "Lam",     5, BIBLE_SEC_PR },
    { "Ezekiel",          "Ezek",   48, BIBLE_SEC_PR },
    { "Daniel",           "Dan",    12, BIBLE_SEC_PR },
    { "Hosea",            "Hos",    14, BIBLE_SEC_PR },
    { "Joel",             "Joel",    3, BIBLE_SEC_PR },
    { "Amos",             "Amos",    9, BIBLE_SEC_PR },
    { "Obadiah",          "Obad",    1, BIBLE_SEC_PR },
    { "Jonah",            "Jonah",   4, BIBLE_SEC_PR },
    { "Micah",            "Mic",     7, BIBLE_SEC_PR },
    { "Nahum",            "Nah",     3, BIBLE_SEC_PR },
    { "Habakkuk",         "Hab",     3, BIBLE_SEC_PR },
    { "Zephaniah",        "Zeph",    3, BIBLE_SEC_PR },
    { "Haggai",           "Hag",     2, BIBLE_SEC_PR },
    { "Zechariah",        "Zech",   14, BIBLE_SEC_PR },
    { "Malachi",          "Mal",     4, BIBLE_SEC_PR },
    // ── Apocrypha (10) ─────────────────────────────────────────────────
    { "Judith",           "Jdt",    16, BIBLE_SEC_AP },
    { "Wisdom",           "Wis",    19, BIBLE_SEC_AP },
    { "Tobit",            "Tob",    14, BIBLE_SEC_AP },
    { "Sirach",           "Sir",    51, BIBLE_SEC_AP },
    { "Baruch",           "Bar",     6, BIBLE_SEC_AP },
    { "1 Maccabees",      "1Macc",  16, BIBLE_SEC_AP },
    { "2 Maccabees",      "2Macc",  15, BIBLE_SEC_AP },
    { "Additions to Esther", "AddEsth", 1, BIBLE_SEC_AP },
    { "Additions to Daniel", "AddDan",  1, BIBLE_SEC_AP },
    { "Prayer of Manasseh",  "PrMan",   1, BIBLE_SEC_AP },
    // ── New Testament (27) ─────────────────────────────────────────────
    { "Matthew",          "Matt",   28, BIBLE_SEC_NT },
    { "Mark",             "Mark",   16, BIBLE_SEC_NT },
    { "Luke",             "Luke",   24, BIBLE_SEC_NT },
    { "John",             "John",   21, BIBLE_SEC_NT },
    { "Acts",             "Acts",   28, BIBLE_SEC_NT },
    { "Romans",           "Rom",    16, BIBLE_SEC_NT },
    { "1 Corinthians",    "1Cor",   16, BIBLE_SEC_NT },
    { "2 Corinthians",    "2Cor",   13, BIBLE_SEC_NT },
    { "Galatians",        "Gal",     6, BIBLE_SEC_NT },
    { "Ephesians",        "Eph",     6, BIBLE_SEC_NT },
    { "Philippians",      "Phil",    4, BIBLE_SEC_NT },
    { "Colossians",       "Col",     4, BIBLE_SEC_NT },
    { "1 Thessalonians",  "1Thess",  5, BIBLE_SEC_NT },
    { "2 Thessalonians",  "2Thess",  3, BIBLE_SEC_NT },
    { "1 Timothy",        "1Tim",    6, BIBLE_SEC_NT },
    { "2 Timothy",        "2Tim",    4, BIBLE_SEC_NT },
    { "Titus",            "Titus",   3, BIBLE_SEC_NT },
    { "Philemon",         "Phlm",    1, BIBLE_SEC_NT },
    { "Hebrews",          "Heb",    13, BIBLE_SEC_NT },
    { "James",            "Jas",     5, BIBLE_SEC_NT },
    { "1 Peter",          "1Pet",    5, BIBLE_SEC_NT },
    { "2 Peter",          "2Pet",    3, BIBLE_SEC_NT },
    { "1 John",           "1John",   5, BIBLE_SEC_NT },
    { "2 John",           "2John",   1, BIBLE_SEC_NT },
    { "3 John",           "3John",   1, BIBLE_SEC_NT },
    { "Jude",             "Jude",    1, BIBLE_SEC_NT },
    { "Revelation",       "Rev",    22, BIBLE_SEC_NT },
};

// ─────────────────────────────────────────────────────────────────────────────
// Global instance
// ─────────────────────────────────────────────────────────────────────────────
#ifdef BOARD_HAS_PSRAM
#  ifndef EXT_RAM_BSS_ATTR
#    ifdef EXT_RAM_ATTR
#      define EXT_RAM_BSS_ATTR EXT_RAM_ATTR
#    else
#      define EXT_RAM_BSS_ATTR
#    endif
#  endif
  EXT_RAM_BSS_ATTR BibleInterface bible_obj;
#else
  BibleInterface bible_obj;
#endif

// ─────────────────────────────────────────────────────────────────────────────
// Constructor
// ─────────────────────────────────────────────────────────────────────────────
BibleInterface::BibleInterface()
    : cur_sec(0), cur_book(0), cur_chapter(1), cur_trans(0),
      mode(MODE_BIBLE), rt_books(nullptr), rt_book_count(0),
      rt_secs(nullptr), rt_sec_count(0), rt_pages(nullptr), rt_page_count(0), rt_pages_book(0xFFFF),
      view(BV_MAIN_MENU), dark_mode(true), theme_idx(0), font_num(2), font_color_idx(0),
      vnum_color_idx(0), orientation(0), accent_def(false), needs_redraw(true),
      settings_scope(0), settings_from_menu(false), set_row_n(0),
      sc_trans_count(0), sc_trans_cur(0),
      menu_sel(0), menu_scroll(0), read_line(0),
      cached_book(0xFFFF), cached_chap(0), cached_count(0),
      line_count(0), trans_count(0), bm_count(0), bm_sel(0), bm_scroll(0),
      bm_confirm_pending(false),
      search_hist_count(0), search_hist_sel(0),
      search_result_count(0), search_res_sel(0),
      highlight_verse(0), reading_from_search(false),
      search_del_pending(false),
      srch_partial_match(true), srch_ignore_punct(true), srch_scope(0),
      accent_idx(0),
      sel_verse_first(0), sel_verse_last(0),
      last_input_ms(0), last_pressed(false), bl_idx(19),
      touch_was_down(false), touch_down_x(0), touch_down_y(0),
      scroll_dragging(false),
      scroll_px(0.f), fling_vel(0.f), fling_ms(0), fling_active(false),
      drag_origin_px(0.f), vbuf_i(0),
      book_offsets(nullptr), book_offsets_cap(0),
      book_idx_valid(false), book_idx_trans(0xFF),
      line_spr(&tft)
#ifdef HAS_BATTERY
    , batt_ok(false), batt_pct(-1), batt_ms(0)
#endif
{
    memset(vbuf_y,        0, sizeof(vbuf_y));
    memset(vbuf_t,        0, sizeof(vbuf_t));
    if (book_offsets) memset(book_offsets, 0, (size_t)book_offsets_cap * sizeof(uint32_t));
    memset(search_query,  0, sizeof(search_query));
    memset(search_hist,   0, sizeof(search_hist));
    memset(search_results,0, sizeof(search_results));
}

// ─────────────────────────────────────────────────────────────────────────────
// RunSetup — called once when Bible firmware starts
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::RunSetup() {
    tft.init();

#ifdef HAS_CAP_TOUCH
    ft6336_init();
#endif

    // Menu-level settings live in their own NVS namespace ("menu"): appearance of
    // the main menu, the global screen orientation, plus the hardware touch
    // calibration. Each content mode opens its own namespace in enterMode().
    prefs.begin("menu", false);
    orientation = prefs.getUChar("orient", 0);
    if (orientation > 3) orientation = 0;
    applyOrientation();                 // global 0-3 orientation — set before first draw
    mode       = MODE_BIBLE;            // accessors unused at the menu; harmless default
    theme_idx  = prefs.getUChar("theme", 0);
    if (theme_idx >= THEME_COUNT) theme_idx = 0;
    dark_mode  = THEMES[theme_idx].dark;
    accent_idx = prefs.getUChar("accent", 0);
    if (accent_idx >= ACCENT_COUNT) accent_idx = 0;
    accent_def = (prefs.getUChar("accentdef", 0) != 0);
    font_num   = 2;
    blInit();   // must run before runTouchCalibration() so the backlight is on

#ifdef MARAUDER_V6_1
    // V6.1: load stored calibration or run first-boot wizard.
    if (prefs.getUChar("tcal2", 0)) {
        uint16_t calData[5];
        prefs.getBytes("tcald2", calData, sizeof(calData));
        tft.setTouch(calData);
    } else {
        runTouchCalibration();
    }
#elif defined(MARAUDER_V8)
    // V8: fixed calibration (portrait, matches Marauder Display.cpp)
    {
        uint16_t calData[5] = { 312, 3431, 191, 3456, 2 };
        tft.setTouch(calData);
    }
#endif

#ifdef HAS_BATTERY
    battInit();
#endif

    goToMainMenu();
}

// ─────────────────────────────────────────────────────────────────────────────
// main — called every loop()
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::main(uint32_t currentTime) {
#ifdef HAS_BATTERY
    if (batt_ok && (currentTime - batt_ms >= 3000)) battUpdate();
#endif
    if (fling_active) updateFling(currentTime);

    if (needs_redraw) {
        switch (view) {
            case BV_MAIN_MENU:       drawMainMenu();       break;
            case BV_TRANS_SELECT:    drawTransSelect();    break;
            case BV_SECTION_SELECT:  drawSectionSelect();  break;
            case BV_BOOK_SELECT:     drawBookSelect();     break;
            case BV_CHAPTER_SELECT:  drawChapterSelect();  break;
            case BV_READING:         drawReading();        break;
            case BV_SETTINGS:        drawSettings();       break;
            case BV_BOOKMARKS:       drawBookmarks();      break;
            case BV_SEARCH_INPUT:    drawSearchInput();    break;
            case BV_SEARCH_RESULTS:  drawSearchResults();  break;
        }
        needs_redraw = false;
    }

    switch (view) {
        case BV_MAIN_MENU:       handleMainMenuInput();                 break;
        case BV_TRANS_SELECT:    handleListInput(trans_count);          break;
        case BV_SECTION_SELECT:  handleListInput(numSecs());      break;
        case BV_BOOK_SELECT:     handleListInput(secLen(cur_sec)); break;
        case BV_CHAPTER_SELECT:
            if (mode == MODE_DICT) handleListInput(rt_page_count);  // page list
            else                   handleChapterInput();            // numeric grid
            break;
        case BV_READING:         handleReadingInput();                  break;
        case BV_SETTINGS:        handleSettingsInput();                 break;
        case BV_BOOKMARKS:       handleBookmarksInput();                break;
        case BV_SEARCH_INPUT:    handleSearchInputInput();              break;
        case BV_SEARCH_RESULTS:  handleSearchResultsInput();            break;
    }
}

// ─────────────────────────────────────────────────────────────────────────────
// Color scheme
// ─────────────────────────────────────────────────────────────────────────────
uint16_t BibleInterface::fg()         const { return THEMES[theme_idx < THEME_COUNT ? theme_idx : 0].fg;  }
uint16_t BibleInterface::bg()         const { return THEMES[theme_idx < THEME_COUNT ? theme_idx : 0].bg;  }
uint16_t BibleInterface::hdr_bg()     const { return THEMES[theme_idx < THEME_COUNT ? theme_idx : 0].hdr; }
uint16_t BibleInterface::sel_bg()     const { return accent_def ? themeHighlight()
                                                   : (dark_mode ? ACCENT_DARK[accent_idx] : ACCENT_LIGHT[accent_idx]); }
uint16_t BibleInterface::dim_fg()     const { return THEMES[theme_idx < THEME_COUNT ? theme_idx : 0].dim; }
uint16_t BibleInterface::verse_num_fg()const{
    if (vnum_color_idx == 0 || vnum_color_idx >= FONT_COLOR_COUNT) return 0x051D; /* muted teal default */
    return FONT_COLOR_VAL[vnum_color_idx];
}
uint16_t BibleInterface::font_fg() const {
    if (font_color_idx == 0 || font_color_idx >= FONT_COLOR_COUNT) return fg();
    return FONT_COLOR_VAL[font_color_idx];
}
// Theme-fitting default Highlight: bg blended ~32% toward fg (subtle, always legible).
uint16_t BibleInterface::themeHighlight() const {
    uint16_t a = bg(), b = fg();
    int ar = (a >> 11) & 0x1F, ag = (a >> 5) & 0x3F, ab = a & 0x1F;
    int br = (b >> 11) & 0x1F, bg5 = (b >> 5) & 0x3F, bb = b & 0x1F;
    const int t = 82;  // ~32% of 255
    int r = ar + (br - ar) * t / 255;
    int g = ag + (bg5 - ag) * t / 255;
    int bl = ab + (bb - ab) * t / 255;
    return (uint16_t)((r << 11) | (g << 5) | bl);
}
bool BibleInterface::isNeon() const { return theme_idx == THEME_NEON; }
// Outline colour for borders/dividers: a stable rainbow hue (seeded by element
// position) when the Neon theme is active, otherwise the caller's default.
uint16_t BibleInterface::edgeColor(int16_t seed, uint16_t def) const {
    if (!isNeon()) return def;
    return NEON_HUES[(uint16_t)(seed < 0 ? -seed : seed) % NEON_COUNT];
}

// ─────────────────────────────────────────────────────────────────────────────
// Layout helpers
// ─────────────────────────────────────────────────────────────────────────────
// Native portrait panel size; swapped when orientation is landscape (1 or 3) so
// the whole layout (which is driven by scrW()/scrH()) adapts automatically.
uint16_t BibleInterface::scrW() const {
#ifdef MARAUDER_PANCAKE
    const uint16_t pw = 320, ph = 480;
#else
    const uint16_t pw = 240, ph = 320;
#endif
    return (orientation & 1) ? ph : pw;
}
uint16_t BibleInterface::scrH() const {
#ifdef MARAUDER_PANCAKE
    const uint16_t pw = 320, ph = 480;
#else
    const uint16_t pw = 240, ph = 320;
#endif
    return (orientation & 1) ? pw : ph;
}

uint16_t BibleInterface::lineH() const {
    switch (font_num) {
        case 1: return 12;
        case 4: return 30;
        default: return 18; // font 2
    }
}
uint8_t BibleInterface::visItems() const { return contentH() / itemH(); }
uint8_t BibleInterface::visLines() const { return contentH() / lineH(); }

// ─────────────────────────────────────────────────────────────────────────────
// Drawing — shared elements
// ─────────────────────────────────────────────────────────────────────────────
// Forward decl: UTF-8-aware glyph draw (defined below; used by drawHeader title).
static int16_t tftCharUTF8(TFT_eSPI& tft, uint8_t c, int16_t x, int16_t y,
                           uint8_t font, uint16_t color);

void BibleInterface::drawHeader(const char* title, bool show_back) {
    tft.fillRect(0, 0, scrW(), hdrH(), hdr_bg());
    if (show_back) {
        // Same style as nav bar buttons: hdr_bg fill + dim_fg border
        tft.fillRoundRect(2, 3, 40, 22, 4, hdr_bg());
        tft.drawRoundRect(2, 3, 40, 22, 4, edgeColor(0, dim_fg()));
        tft.setTextColor(TFT_WHITE, hdr_bg());
        tft.drawCentreString("<", 22, 10, 1);
    }
    // Title — rendered char-by-char so umlauts/ß (private codes) show correctly
    // (song titles, dictionary word pairs). Centred, clipped to avoid the back
    // button (left) and the search/battery area (right).
    {
        int16_t left   = show_back ? 46 : 4;
        bool    full_w = (view == BV_MAIN_MENU) || (view == BV_SETTINGS && settings_from_menu);
        int16_t right  = full_w ? (int16_t)scrW() - 4 : (int16_t)scrW() - 66;
        int16_t tw     = textWidthUTF8(title, 2);
        int16_t tx0    = (int16_t)(scrW() / 2) - tw / 2;
        if (tx0 < left)  tx0 = left;
        tft.setTextColor(TFT_WHITE, hdr_bg());
        for (const char* p = title; *p && tx0 < right; p++)
            tx0 += tftCharUTF8(tft, (uint8_t)*p, tx0, 6, 2, TFT_WHITE);
    }

    // Search button — same bordered-box style as the back button.
    // Hidden on the main menu and on menu-opened Settings (no content to search).
    // Positioned to the left of the battery % text.
    bool hide_search = (view == BV_MAIN_MENU) || (view == BV_SETTINGS && settings_from_menu);
    if (!hide_search) {
        int16_t sb_x = (int16_t)scrW() - 63;
        tft.fillRoundRect(sb_x,     3, 28, 22, 4, hdr_bg());
        tft.drawRoundRect(sb_x,     3, 28, 22, 4, edgeColor(3, dim_fg()));
        // Magnifying glass inside the button (circle + diagonal handle)
        int16_t cx = sb_x + 13;   // horizontal centre of button
        tft.drawCircle(cx,     14, 5, TFT_WHITE);
        tft.drawLine  (cx + 4, 18, cx + 7, 21, TFT_WHITE);
    }

#ifdef HAS_BATTERY
    if (batt_pct >= 0) {
        char pct[8];
        snprintf(pct, sizeof(pct), "%d%%", (int)batt_pct);
        tft.drawRightString(pct, (int16_t)(scrW() - 3), 10, 1);
    }
#endif
}

void BibleInterface::drawNavBar(const char* left, const char* mid, const char* right) {
    uint16_t y     = scrH() - navH();
    uint16_t third = scrW() / 3;
    uint16_t bh    = navH() - 8;   // button height (4 px margin top + bottom)
    uint16_t by    = y + 4;
    uint16_t bw    = third - 8;    // button width  (4 px margin each side)

    // Nav area background + divider line
    tft.fillRect(0, y, scrW(), navH(), bg());
    tft.drawFastHLine(0, y, scrW(), edgeColor(5, dark_mode ? 0x2104 : 0xC618));

    // Draw each non-empty label as a rounded button
    const char* labels[3] = { left, mid, right };
    for (uint8_t i = 0; i < 3; i++) {
        if (!labels[i] || !labels[i][0]) continue;
        uint16_t cx = i * third + third / 2;
        uint16_t bx = cx - bw / 2;
        tft.fillRoundRect(bx, by, bw, bh, 4, hdr_bg());
        tft.drawRoundRect(bx, by, bw, bh, 4, edgeColor(i * 2, dim_fg()));
        tft.setTextColor(TFT_WHITE, hdr_bg());
        tft.drawCentreString(labels[i], cx, by + (bh - 8) / 2, 1);
    }
}

void BibleInterface::clearContent() {
    tft.fillRect(0, contentY(), scrW(), contentH(), bg());
}

// Draw one private-code character on tft at (x, y) in the given font.
// setTextColor must be set by the caller before use.  Returns advance width.
static int16_t tftCharUTF8(TFT_eSPI& tft, uint8_t c, int16_t x, int16_t y,
                             uint8_t font, uint16_t color) {
    static const char ubases[] = {'A','a','O','o','U','u'};
    if (c == 0x86)
        return bibleDrawSzlig(tft, x, y, font, color);
    if (c >= 0x80 && c <= 0x85) {
        bool    is_lower = ((c - 0x80) & 1) != 0;
        int16_t adv      = tft.drawChar((uint16_t)(uint8_t)ubases[c - 0x80], x, y, font);
        bibleDrawUmlautDots(tft, x, y, adv, is_lower, font, color);
        return adv;
    }
    return tft.drawChar((uint16_t)c, x, y, font);
}

void BibleInterface::drawListRow(int16_t y_px, const char* text, bool selected, bool has_arrow) {
    uint16_t bg_c  = selected ? sel_bg() : bg();
    uint16_t fg_c  = fg();
    // Right edge: leave room for scrollbar (6px) + arrow (14px) + small gap
    int16_t  max_x = (int16_t)scrW() - (has_arrow ? 28 : 8);
    int16_t  ty    = y_px + (itemH() - 16) / 2;
    tft.fillRect(0, y_px, scrW(), itemH(), bg_c);
    tft.setTextColor(fg_c, bg_c);
    // Draw text char-by-char with private-code umlaut/ß support
    int16_t tx = 10;
    for (const char* p = text; *p && tx < max_x; p++)
        tx += tftCharUTF8(tft, (uint8_t)*p, tx, ty, 2, fg_c);
    if (has_arrow) {
        tft.setTextColor(dim_fg(), bg_c);
        tft.drawString(">", scrW() - 20, ty, 2);
    }
    // divider
    tft.drawFastHLine(0, y_px + itemH() - 1, scrW(),
                      edgeColor(y_px / (int16_t)itemH(), dark_mode ? 0x2104 : 0xC618));
}

void BibleInterface::drawScrollBar(int16_t total, int16_t vis, int16_t top) {
    if (total <= vis) return;
    uint16_t barX = scrW() - 6;
    uint16_t barY = contentY();
    uint16_t barH = contentH();
    tft.fillRect(barX, barY, 6, barH, dark_mode ? 0x2104 : 0xC618);
    int16_t thumbH = max((int16_t)10, (int16_t)(barH * vis / total));
    int16_t thumbY = barY + (int16_t)((int32_t)top * (barH - thumbH) / max(1, total - vis));
    tft.fillRect(barX, thumbY, 6, thumbH, edgeColor(top, dim_fg()));
}

// Redraws only the list content area (rows + scrollbar) without touching the
// header or nav bar.  Called directly during scroll drag/fling so there is no
// full-screen repaint — eliminating the white/black flash between frames.
// Uses scroll_px for sub-item-height pixel accuracy.
// setViewport clips rows that extend into the header or nav bar zones.
// startWrite / endWrite batches all SPI transfers in one transaction for speed.
void BibleInterface::redrawListContent(uint16_t item_count) {
    int16_t sub_px      = (int16_t)fmodf(scroll_px, (float)itemH());
    int16_t first       = (int16_t)(scroll_px / (float)itemH());
    int16_t content_top = (int16_t)contentY();
    int16_t content_end = content_top + (int16_t)contentH();

    tft.startWrite();
    // Clip all draws to the content zone — prevents header/nav bleed without a
    // global clear (which would cause flash). vpDatum=false keeps screen-absolute coords.
    tft.setViewport(0, contentY(), scrW(), contentH(), false);

    int16_t last_bottom = content_top;

    for (int i = 0; ; i++) {
        int16_t idx = first + i;
        int16_t y   = content_top - sub_px + i * (int16_t)itemH();
        if (y >= content_end || idx >= (int16_t)item_count) break;

        switch (view) {
            case BV_TRANS_SELECT:
                drawListRow(y, trans_stems[idx],
                            idx == (int16_t)menu_sel);
                break;
            case BV_SECTION_SELECT:
                if (idx < (int16_t)numSecs())
                    drawListRow(y, secName(idx), idx == (int16_t)menu_sel);
                break;
            case BV_BOOK_SELECT:
                drawListRow(y, bookDisplay(secStart(cur_sec) + idx),
                            idx == (int16_t)menu_sel);
                break;
            case BV_CHAPTER_SELECT:   // Dictionary page list (smooth scroll)
                drawListRow(y, pageLabel(idx), idx == (int16_t)menu_sel, false);
                break;
            case BV_BOOKMARKS:
                drawListRow(y, bookmarks[idx].label,
                            idx == (int16_t)bm_sel, false);
                break;
            case BV_SEARCH_INPUT:
                drawListRow(y, search_hist[idx], idx == (int16_t)search_hist_sel, false);
                break;
            default: break;
        }
        int16_t bot = y + (int16_t)itemH();
        if (bot > last_bottom) last_bottom = bot;
    }

