H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    int16_t total_rows = ((int16_t)chaps + 4) / 5;
    drawScrollBar(total_rows, vis_rows, menu_scroll);
    drawNavBar("Marks", "Settings", "Bright");
}

// ─────────────────────────────────────────────────────────────────────────────
// Reading view — draws the paged verse text
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::drawReadingLines() {
    int16_t  sub_px = (int16_t)fmodf(scroll_px, (float)lineH());
    int16_t  first  = (int16_t)(scroll_px / (float)lineH());
    uint8_t  vis    = visLines() + 1;   // +1 covers partial bottom row
    int16_t  cy     = (int16_t)contentY();
    int16_t  ce     = cy + (int16_t)contentH();
    uint16_t lh     = lineH();

    read_line = first;

    // Allocate one line-height sprite for atomic pushes — eliminates both the
    // per-line ripple (interleaved fill+draw) and the full-zone flash (single
    // big clear).  Each pushSprite() is a single SPI burst; the TFT viewport
    // clips any partial line at the header/nav boundaries.
    if (!line_spr.createSprite(scrW(), lh)) {
        // Allocation failed (very low heap) — fall back to direct draw.
        tft.startWrite();
        tft.fillRect(0, cy, scrW(), contentH(), bg());
        tft.endWrite();
        return;
    }

    tft.setViewport(0, cy, scrW(), contentH(), false);

    // Track current verse number for highlight support.
    // Scan backward from 'first' to find which verse that line belongs to.
    uint8_t cur_verse_num = 0;
    for (int16_t k = first; k >= 0; k--) {
        if (lines[k][0] == '^') {
            const char* pipe = strchr(lines[k] + 1, '|');
            if (pipe) { cur_verse_num = (uint8_t)atoi(lines[k] + 1); break; }
        }
    }
    // Highlight background — accent colour from Settings
    uint16_t hi_bg = sel_bg();

    // Precompute bookmark verse-range for this chapter (first matching verse bookmark).
    // Bookmark verse ranges are highlighted the same as search/selection highlights.
    uint8_t bm_v1 = 0, bm_v2 = 0;
    for (uint8_t k = 0; k < bm_count; k++) {
        if (bookmarks[k].book == cur_book && bookmarks[k].chapter == cur_chapter
                && bookmarks[k].verse_first > 0) {
            bm_v1 = bookmarks[k].verse_first;
            bm_v2 = bookmarks[k].verse_last;
            break;  // show first matching range only
        }
    }

    for (uint8_t i = 0; i < vis; i++) {
        int16_t row_y    = cy - sub_px + (int16_t)i * (int16_t)lh;
        if (row_y >= ce) break;

        int16_t line_idx = first + (int16_t)i;

        // Update verse tracking before drawing
        if (line_idx >= 0 && line_idx < (int16_t)line_count) {
            const char* ln = lines[line_idx];
            if (ln[0] == '^') {
                const char* pipe = strchr(ln + 1, '|');
                if (pipe) cur_verse_num = (uint8_t)atoi(ln + 1);
            }
        }

        uint16_t line_bg = bg();
        if (highlight_verse > 0 && cur_verse_num == highlight_verse)
            line_bg = hi_bg;
        else if (sel_verse_first > 0
                 && cur_verse_num >= sel_verse_first
                 && cur_verse_num <= sel_verse_last)
            line_bg = hi_bg;
        else if (bm_v1 > 0
                 && cur_verse_num >= bm_v1
                 && cur_verse_num <= bm_v2)
            line_bg = hi_bg;

        line_spr.fillSprite(line_bg);

        if (line_idx >= 0 && line_idx < (int16_t)line_count) {
            const char* ln = lines[line_idx];
            if (ln[0] == '^') {
                const char* pipe = strchr(ln + 1, '|');
                if (pipe) {
                    char num_str[12];
                    int  n_len = (int)(pipe - (ln + 1));
                    if (n_len > 6) n_len = 6;
                    memcpy(num_str, ln + 1, n_len);
                    num_str[n_len]     = '.';
                    num_str[n_len + 1] = 0;
                    line_spr.setTextColor(verse_num_fg(), line_bg);
                    int16_t nx = line_spr.drawString(num_str, 4, 2, font_num);
                    line_spr.setTextColor(font_fg(), line_bg);
                    drawStringUTF8(line_spr, pipe + 1, 4 + nx + 2, 2, font_num, font_fg());
                }
            } else {
                line_spr.setTextColor(font_fg(), line_bg);
                drawStringUTF8(line_spr, ln, 4, 2, font_num, font_fg());
            }
        }

        // pushSprite respects the viewport set above, clipping partial lines
        line_spr.pushSprite(0, row_y);
    }

    tft.resetViewport();
    line_spr.deleteSprite();
}

void BibleInterface::drawReading() {
    tft.fillScreen(bg());
    char hdr[56];
    if (mode == MODE_DICT) {
        // Dictionary: show the open page's word pair ("firstword - lastword").
        const char* pl = pageLabel(cur_chapter - 1);
        if (pl && pl[0]) snprintf(hdr, sizeof(hdr), "%s", pl);
        else             snprintf(hdr, sizeof(hdr), "%s p%d", bookDisplay(cur_book), cur_chapter);
    } else if (bookChapters(cur_book) <= 1) {
        // Single-chapter books (Songs) show just the title — no redundant " 1".
        snprintf(hdr, sizeof(hdr), "%s", bookDisplay(cur_book));
    } else {
        snprintf(hdr, sizeof(hdr), "%s %d", bookDisplay(cur_book), cur_chapter);
    }
    drawHeader(hdr);
    drawReadingLines();
    drawNavBar("Marks", "Settings", "+Mark");
}

// ─────────────────────────────────────────────────────────────────────────────
// Settings screen
// ─────────────────────────────────────────────────────────────────────────────
// Settings row indices (kept in sync with handleSettingsInput):
//   0 Font Size · 1 Font Color · 2 Verse # Color · 3 Theme · 4 Brightness
//   5 Song Book/Translation/Dictionary · 6 Highlight · 7 Orientation
//   8 Boot OTA_1 · 9 Calibrate Touch (resistive only)
static const char* const SCOPE_NAMES[5] = { "Global", "Main Menu", "Bible", "Songs", "Dictionary" };

// Representative NVS namespace used to READ a scope's settings.
static const char* scopeReadNs(uint8_t scope) {
    switch (scope) {
        case 2: return "bible";
        case 3: return "songs";
        case 4: return "dict";
        default: return "menu";   // Global / Main Menu
    }
}

uint8_t BibleInterface::settingsScopeMode() const {
    switch (settings_scope) {
        case 2: return MODE_BIBLE;
        case 3: return MODE_SONGS;
        case 4: return MODE_DICT;
        default: return 0xFF;     // Global / Main Menu have no translation
    }
}

void BibleInterface::buildSettingsRows() {
    uint8_t k = 0;
    set_rows[k++] = SR_SCOPE;
    if (settingsScopeMode() != 0xFF) set_rows[k++] = SR_TRANS;   // Translation near the top
    set_rows[k++] = SR_FONTSIZE;
    set_rows[k++] = SR_FONTCOL;
    set_rows[k++] = SR_VNUMCOL;
    set_rows[k++] = SR_THEME;
    set_rows[k++] = SR_HIGHLIGHT;
    set_rows[k++] = SR_ORIENT;
    set_rows[k++] = SR_BRIGHT;                                    // just above Boot
    set_rows[k++] = SR_BOOT;
#ifndef HAS_CAP_TOUCH
    set_rows[k++] = SR_CALIB;
#endif
    set_row_n = k;
}

// Write one "look" setting to every NVS namespace covered by the current scope
// (Global = all modes + menu; otherwise just the scope's namespace).
void BibleInterface::writeScoped(const char* key, uint8_t val) {
    static const char* const ALL[] = { "bible", "songs", "dict", "menu" };
    Preferences p;
    if (settings_scope == 0) {            // Global
        for (uint8_t i = 0; i < 4; i++)
            if (p.begin(ALL[i], false)) { p.putUChar(key, val); p.end(); }
    } else {
        if (p.begin(scopeReadNs(settings_scope), false)) { p.putUChar(key, val); p.end(); }
    }
}

// Load the scope's "look" settings into the live member vars (also previews the
// scope on the settings screen). Brightness/orientation are global (excluded).
void BibleInterface::loadScopeSettings() {
    Preferences p;
    bool ok = p.begin(scopeReadNs(settings_scope), true);
    theme_idx      = ok ? p.getUChar("theme",    0) : 0;
    accent_idx     = ok ? p.getUChar("accent",   0) : 0;
    accent_def     = ok ? (p.getUChar("accentdef", 0) != 0) : false;
    font_num       = ok ? p.getUChar("font",     2) : 2;
    font_color_idx = ok ? p.getUChar("fontcol",  0) : 0;
    vnum_color_idx = ok ? p.getUChar("vnumcol",  0) : 0;
    if (ok) p.end();
    if (theme_idx      >= THEME_COUNT)      theme_idx = 0;
    if (accent_idx     >= ACCENT_COUNT)     accent_idx = 0;
    if (font_num != 1 && font_num != 2 && font_num != 4) font_num = 2;
    if (font_color_idx >= FONT_COLOR_COUNT) font_color_idx = 0;
    if (vnum_color_idx >= FONT_COLOR_COUNT) vnum_color_idx = 0;
    dark_mode = THEMES[theme_idx].dark;
}

// Scan the scope mode's SD folder for translations into sc_trans[], and set
// sc_trans_cur from that scope's saved "trans" index.
void BibleInterface::scopeScanTrans() {
    sc_trans_count = 0; sc_trans_cur = 0;
    uint8_t m = settingsScopeMode();
    if (m == 0xFF) return;
    const char* base = (m == MODE_SONGS) ? SONGS_SD_BASE
                     : (m == MODE_DICT)  ? DICT_SD_BASE : BIBLE_SD_BASE;
    File root = SD.open(base);
    if (root) {
        while (sc_trans_count < BIBLE_MAX_TRANS) {
            File e = root.openNextFile();
            if (!e) break;
            if (e.isDirectory()) { e.close(); continue; }
            String name = e.name(); e.close();
            name.toLowerCase();
            if (!name.endsWith(".xml")) continue;
            int slash = name.lastIndexOf('/'); if (slash >= 0) name = name.substring(slash + 1);
            String stem = name.substring(0, name.length() - 4);
            strncpy(sc_trans[sc_trans_count], stem.c_str(), BIBLE_TRANS_LEN - 1);
            sc_trans[sc_trans_count][BIBLE_TRANS_LEN - 1] = 0;
            sc_trans_count++;
        }
        root.close();
    }
    for (uint8_t i = 0; i + 1 < sc_trans_count; i++)
        for (uint8_t j = i + 1; j < sc_trans_count; j++)
            if (strcmp(sc_trans[j], sc_trans[i]) < 0) {
                char t[BIBLE_TRANS_LEN];
                strncpy(t, sc_trans[i], BIBLE_TRANS_LEN);
                strncpy(sc_trans[i], sc_trans[j], BIBLE_TRANS_LEN);
                strncpy(sc_trans[j], t, BIBLE_TRANS_LEN);
            }
    Preferences p; uint8_t cur = 0;
    if (p.begin(scopeReadNs(settings_scope), true)) { cur = p.getUChar("trans", 0); p.end(); }
    sc_trans_cur = (cur < sc_trans_count) ? cur : 0;
}

void BibleInterface::redrawSettingsContent() {
    const uint8_t  vis   = visItems();
    const int16_t  btn_w = 28, btn_h = 22, btn_r = 4;

    // Pixel-accurate scroll (same momentum machinery as the other lists).
    int16_t sub_px      = (int16_t)fmodf(scroll_px, (float)itemH());
    int16_t first       = (int16_t)(scroll_px / (float)itemH());
    int16_t content_top = (int16_t)contentY();
    int16_t content_end = content_top + (int16_t)contentH();

    tft.startWrite();
    tft.setViewport(0, contentY(), scrW(), contentH(), false);

    // [<] Name [>] choice row. name_col = colour to draw the value text in
    // (0 = default fg). Font/Verse colour rows pass the actual colour so the user
    // previews it; others pass 0.
    auto choiceRow = [&](int16_t row_y, const char* label, const char* name,
                         bool sel, uint16_t name_col) {
        drawListRow(row_y, label, sel, false);
        uint16_t bg_c  = sel ? sel_bg() : bg();
        int16_t  btn_y = row_y + (itemH() - btn_h) / 2;
        int16_t  txt_y = btn_y + (btn_h - 16) / 2;
        int16_t  nam_y = row_y + (itemH() - 16) / 2;
        int16_t  fwd_bx = (int16_t)scrW() - 9 - btn_w;   // -9 clears the 6px scrollbar
        int16_t  eseed = row_y / (int16_t)itemH();
        tft.fillRoundRect(fwd_bx, btn_y, btn_w, btn_h, btn_r, hdr_bg());
        tft.drawRoundRect(fwd_bx, btn_y, btn_w, btn_h, btn_r, edgeColor(eseed, dim_fg()));
        tft.setTextColor(TFT_WHITE, hdr_bg());
        tft.drawCentreString(">", fwd_bx + btn_w / 2, txt_y, 2);
        int16_t nam_w = (int16_t)tft.textWidth(name, 2);
        int16_t nam_x = fwd_bx - 4 - nam_w;
        tft.setTextColor(name_col ? name_col : fg(), bg_c);
        tft.drawString(name, nam_x, nam_y, 2);
        int16_t bwd_bx = nam_x - 4 - btn_w;
        tft.fillRoundRect(bwd_bx, btn_y, btn_w, btn_h, btn_r, hdr_bg());
        tft.drawRoundRect(bwd_bx, btn_y, btn_w, btn_h, btn_r, edgeColor(eseed + 4, dim_fg()));
        tft.setTextColor(TFT_WHITE, hdr_bg());
        tft.drawCentreString("<", bwd_bx + btn_w / 2, txt_y, 2);
    };
    auto brightRow = [&](int16_t row_y, bool sel) {
        drawListRow(row_y, "Brightness", sel, false);
        uint16_t bg_c  = sel ? sel_bg() : bg();
        int16_t  btn_y = row_y + (itemH() - btn_h) / 2;
        int16_t  txt_y = btn_y + (btn_h - 16) / 2;
        int16_t  num_y = row_y + (itemH() - 16) / 2;
        int16_t  eseed = row_y / (int16_t)itemH();
        int16_t plus_bx = (int16_t)scrW() - 9 - btn_w;
        tft.fillRoundRect(plus_bx, btn_y, btn_w, btn_h, btn_r, hdr_bg());
        tft.drawRoundRect(plus_bx, btn_y, btn_w, btn_h, btn_r, edgeColor(eseed, dim_fg()));
        tft.setTextColor(TFT_WHITE, hdr_bg());
        tft.drawCentreString("+", plus_bx + btn_w / 2, txt_y, 2);
        char nbuf[8];
        snprintf(nbuf, sizeof(nbuf), "%d/20", bl_idx + 1);
        int16_t num_w = (int16_t)tft.textWidth(nbuf, 2);
        int16_t num_x = plus_bx - 4 - num_w;
        tft.setTextColor(fg(), bg_c);
        tft.drawString(nbuf, num_x, num_y, 2);
        int16_t minus_bx = num_x - 4 - btn_w;
        tft.fillRoundRect(minus_bx, btn_y, btn_w, btn_h, btn_r, hdr_bg());
        tft.drawRoundRect(minus_bx, btn_y, btn_w, btn_h, btn_r, edgeColor(eseed + 4, dim_fg()));
        tft.setTextColor(TFT_WHITE, hdr_bg());
        tft.drawCentreString("-", minus_bx + btn_w / 2, txt_y, 2);
    };

    int16_t last_bottom = content_top;
    for (int vi = 0; ; vi++) {
        int16_t i     = first + vi;
        int16_t row_y = content_top - sub_px + vi * (int16_t)itemH();
        if (row_y >= content_end || i >= (int16_t)set_row_n) break;
        bool sel = (i == (int16_t)menu_sel);

