H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
        switch (set_rows[i]) {
            case SR_SCOPE:
                choiceRow(row_y, "Settings Scope", SCOPE_NAMES[settings_scope], sel, 0);
                break;
            case SR_TRANS: {
                uint8_t sm = settingsScopeMode();
                const char* tl = (sm == MODE_SONGS) ? "Song Book"
                               : (sm == MODE_DICT)  ? "Dictionary" : "Translation";
                choiceRow(row_y, tl, sc_trans_count > 0 ? sc_trans[sc_trans_cur] : "-", sel, 0);
                break;
            }
            case SR_FONTSIZE: {
                const char* sz = (font_num == 1) ? "Small" : (font_num == 2) ? "Medium" : "Large";
                choiceRow(row_y, "Font Size", sz, sel, 0);
                break;
            }
            case SR_FONTCOL:   choiceRow(row_y, "Font Color",    FONT_COLOR_NAMES[font_color_idx], sel, font_fg());       break;
            case SR_VNUMCOL:   choiceRow(row_y, "Verse # Color", FONT_COLOR_NAMES[vnum_color_idx], sel, verse_num_fg()); break;
            case SR_THEME:     choiceRow(row_y, "Theme",         THEMES[theme_idx].name,           sel, 0);              break;
            case SR_HIGHLIGHT: choiceRow(row_y, "Highlight", accent_def ? "Default" : ACCENT_NAMES[accent_idx], sel, 0); break;
            case SR_ORIENT:    choiceRow(row_y, "Orientation",   ORIENT_NAMES[orientation & 3],    sel, 0);              break;
            case SR_BRIGHT:    brightRow(row_y, sel); break;
            case SR_BOOT:      drawListRow(row_y, "Boot OTA_1",      sel, false); break;
            case SR_CALIB:     drawListRow(row_y, "Calibrate Touch", sel, false); break;
        }
        int16_t bot = row_y + (int16_t)itemH();
        if (bot > last_bottom) last_bottom = bot;
    }

    if (last_bottom < content_end)
        tft.fillRect(0, last_bottom, scrW(), content_end - last_bottom, bg());

    tft.resetViewport();
    drawScrollBar((int16_t)set_row_n, vis, first);
    tft.endWrite();
}

void BibleInterface::drawSettings() {
    tft.fillScreen(bg());
    drawHeader("Settings");
    redrawSettingsContent();
    // Footer: show a "Menu" button (bottom-right) only when opened from a mode.
    drawNavBar("Back", "", settings_from_menu ? "" : "Menu");
}

// ─────────────────────────────────────────────────────────────────────────────
// Bookmarks screen
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::drawBookmarks() {
    tft.fillScreen(bg());
    drawHeader("Bookmarks");
    if (bm_count == 0) {
        tft.setTextColor(dim_fg(), bg());
        tft.drawCentreString("No bookmarks yet", scrW()/2, contentY() + 20, 2);
        drawNavBar("Back", "", "");
        return;
    }
    uint8_t vis = visItems();
    for (uint8_t i = 0; i < vis && (bm_scroll + i) < bm_count; i++) {
        bool sel = (bm_scroll + i) == (uint8_t)bm_sel;
        drawListRow(contentY() + i * itemH(), bookmarks[bm_scroll + i].label, sel, false);
    }
    drawScrollBar(bm_count, vis, bm_scroll);
    drawNavBar("Back", "View", "Del");
    if (bm_confirm_pending) drawConfirmDelete();
}

// Delete-confirmation popup — drawn on top of the bookmark list.
// Geometry is computed from scrW()/scrH() so it scales for both boards.
//
//  ┌─────────────────────────────────┐
//  │       Delete bookmark?          │
//  │                                 │
//  │  [ Cancel ]       [ Delete ]    │
//  └─────────────────────────────────┘
//
// Touch detection: lift inside the Delete button confirms; anywhere else cancels.
void BibleInterface::drawConfirmDelete() {
    int16_t pop_w = (int16_t)scrW() - 40;   // 20 px margin each side
    int16_t pop_h = 80;
    int16_t pop_x = 20;
    int16_t pop_y = (int16_t)(scrH() / 2) - 40;

    // Panel — filled with bg() so it covers content behind it
    tft.fillRoundRect(pop_x,     pop_y,     pop_w,     pop_h,     6, bg());
    tft.drawRoundRect(pop_x,     pop_y,     pop_w,     pop_h,     6, dim_fg());
    tft.drawRoundRect(pop_x + 1, pop_y + 1, pop_w - 2, pop_h - 2, 6, dim_fg());

    // Message
    tft.setTextColor(fg(), bg());
    tft.drawCentreString("Delete bookmark?", scrW() / 2, pop_y + 10, 2);

    // Button row — two equal-width buttons separated by a small gap
    int16_t btn_y  = pop_y + 44;
    int16_t btn_h  = 28;
    int16_t half_w = pop_w / 2 - 6;    // each button width
    int16_t del_x  = pop_x + pop_w / 2 + 2;

    // Cancel (left)
    tft.fillRoundRect(pop_x + 4, btn_y, half_w, btn_h, 4, hdr_bg());
    tft.drawRoundRect(pop_x + 4, btn_y, half_w, btn_h, 4, dim_fg());
    tft.setTextColor(TFT_WHITE, hdr_bg());
    tft.drawCentreString("Cancel", pop_x + 4 + half_w / 2, btn_y + (btn_h - 8) / 2, 1);

    // Delete (right) — red border + red text to signal destructive action
    tft.fillRoundRect(del_x, btn_y, half_w, btn_h, 4, hdr_bg());
    tft.drawRoundRect(del_x, btn_y, half_w, btn_h, 4, TFT_RED);
    tft.setTextColor(TFT_RED, hdr_bg());
    tft.drawCentreString("Delete", del_x + half_w / 2, btn_y + (btn_h - 8) / 2, 1);
}

// ─────────────────────────────────────────────────────────────────────────────
// Touch input
// ─────────────────────────────────────────────────────────────────────────────
bool BibleInterface::getTouch(uint16_t* tx, uint16_t* ty) {
#ifdef HAS_CAP_TOUCH
    uint16_t raw_x, raw_y;
    uint8_t touches = ft6336_update(&raw_x, &raw_y);
    if (touches == 0) { last_pressed = false; return false; }
    // FT6336 returns panel-native coords; map to the active orientation.
    *tx = raw_x;
    *ty = raw_y;
    orientTouch(*tx, *ty);
#else
    uint16_t cal[5] = {0,0,0,0,0}; // use default calibration
    (void)cal;
    if (!tft.getTouch(tx, ty, 600)) { last_pressed = false; return false; }
#endif
    uint32_t now = millis();
    if (last_pressed && (now - last_input_ms) < 200) return false;
    last_pressed   = true;
    last_input_ms  = now;
    return true;
}

// Raw touch poll — no debounce, used for gesture detection in list views.
bool BibleInterface::pollTouch(uint16_t* tx, uint16_t* ty) {
#ifdef HAS_CAP_TOUCH
    uint16_t raw_x, raw_y;
    if (!ft6336_update(&raw_x, &raw_y)) { last_pressed = false; return false; }
    *tx = raw_x; *ty = raw_y;
    orientTouch(*tx, *ty);   // map panel-native coords to the active orientation
#else
    // Resistive: TFT_eSPI getTouch() already maps through the active setRotation.
    if (!tft.getTouch(tx, ty, 600)) { last_pressed = false; return false; }
#endif
    last_pressed  = true;
    last_input_ms = millis();
    return true;
}

bool BibleInterface::touchInHeader(uint16_t /*x*/, uint16_t y) {
    return y < hdrH();
}

