H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
            if (v > 0) {
                if (sel_verse_first == 0) {
                    // Nothing selected → select this verse
                    sel_verse_first = sel_verse_last = v;
                } else if (v >= sel_verse_first && v <= sel_verse_last) {
                    // Tap on already-selected verse
                    if (sel_verse_first == sel_verse_last) {
                        sel_verse_first = sel_verse_last = 0;  // deselect single
                    } else if (v == sel_verse_first) {
                        sel_verse_first++;                      // shrink from start
                    } else if (v == sel_verse_last) {
                        sel_verse_last--;                       // shrink from end
                    } else {
                        sel_verse_first = sel_verse_last = v;  // middle → reset to this
                    }
                } else if (v == sel_verse_last + 1) {
                    sel_verse_last = v;                         // extend end
                } else if (v + 1 == sel_verse_first) {
                    sel_verse_first = v;                        // extend start
                } else {
                    sel_verse_first = sel_verse_last = v;       // non-adjacent → reset
                }
                drawReadingLines();
                return;
            }
        }

        // Upper half = previous page/chapter, lower = next
        uint16_t mid = scrH() / 2;
        if (touch_down_y < mid) {
            int16_t prev = read_line - (int16_t)visLines();
            if (prev >= 0) {
                scroll_px = (float)prev * (float)lineH();
                drawReadingLines();
            } else if (scroll_px > 0.f) {
                scroll_px = 0.f;
                drawReadingLines();
            } else if (cur_chapter > 1) {
                goToReading(cur_chapter - 1);
            }
        } else {
            int16_t next = read_line + (int16_t)visLines();
            if (next < (int16_t)line_count) {
                scroll_px = (float)next * (float)lineH();
                drawReadingLines();
            } else if (cur_chapter < bookChapters(cur_book)) {
                goToReading(cur_chapter + 1);
            }
        }
    }
}

void BibleInterface::handleSettingsInput() {
    const uint8_t SETTINGS_N = set_row_n;
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

    // ── Finger just touched down ──────────────────────────────────────────────
    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;
        stopFling();
        drag_origin_px  = scroll_px;

        // Header and nav fire immediately on press (no drag ambiguity)
        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (!settings_from_menu && touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            if (tx < scrW()/3) goBack();
            else if (tx > 2 * (scrW()/3) && !settings_from_menu) goToMainMenu();  // footer Menu
            return;
        }
        // Highlight touched (absolute) row immediately for press feedback.
        int16_t row = (int16_t)((scroll_px + (float)((int16_t)ty - (int16_t)contentY())) / (float)itemH());
        if (row >= 0 && row < (int16_t)SETTINGS_N) {
            menu_sel = row;
            redrawSettingsContent();
        }
        return;
    }

    // ── Finger held — pixel-accurate drag (momentum like the other lists) ─────
    if (down && touch_was_down) {
        int16_t dy = (int16_t)ty - (int16_t)touch_down_y;
        if (!scroll_dragging && abs(dy) > 8) {
            scroll_dragging = true;
            menu_sel = -1;
        }
        if (scroll_dragging) {
            float max_px = (float)max(0, (int)SETTINGS_N - (int)visItems()) * (float)itemH();
            float new_px = drag_origin_px + (float)((int16_t)touch_down_y - (int16_t)ty);
            if (new_px < 0.f) new_px = 0.f;
            if (new_px > max_px) new_px = max_px;
            scroll_px   = new_px;
            menu_scroll = (int16_t)(scroll_px / (float)itemH());
            recordVel((int16_t)ty, millis());
            redrawSettingsContent();
        }
        return;
    }

    // ── Finger lifted — fling, or activate the item highlighted on press ──────
    if (!down && touch_was_down) {
        touch_was_down = false;
        if (scroll_dragging) {
            scroll_dragging = false;
            float v = computeFlingVel();
            if (fabsf(v) > 50.f) {
                fling_vel    = v < -4000.f ? -4000.f : v > 4000.f ? 4000.f : v;
                fling_active = true;
                fling_ms     = millis();
            } else {
                stopFling();
            }
            return;
        }
        if (menu_sel < 0 || menu_sel >= (int16_t)SETTINGS_N) return;

        bool fwd = ((int16_t)touch_down_x >= (int16_t)scrW() - 32);  // [>] vs [<]
        switch ((SettingRow)set_rows[menu_sel]) {
            case SR_SCOPE:
                settings_scope = fwd ? (uint8_t)((settings_scope + 1) % 5)
                                     : (settings_scope == 0 ? 4 : settings_scope - 1);
                buildSettingsRows();
                loadScopeSettings();   // preview + edit the chosen scope's look
                scopeScanTrans();
                menu_sel = 0; menu_scroll = 0; scroll_px = 0.f;
                drawSettings();        // theme may differ — full repaint
                return;
            case SR_TRANS:
                if (sc_trans_count > 1) {
                    sc_trans_cur = fwd ? (uint8_t)((sc_trans_cur + 1) % sc_trans_count)
                                       : (sc_trans_cur == 0 ? sc_trans_count - 1 : sc_trans_cur - 1);
                    { Preferences p;
                      if (p.begin(scopeReadNs(settings_scope), false)) {
                          p.putUChar("trans", sc_trans_cur); p.end(); } }
                    // If editing the active mode's own scope, switch it live too.
                    if (!settings_from_menu && settingsScopeMode() == mode) {
                        cur_trans = sc_trans_cur;
                        cached_book = 0xFFFF; cached_chap = 0; cached_count = 0;
                        book_idx_valid = false;
                        if (mode != MODE_BIBLE) {
                            if (loadToc(trans_stems[cur_trans])) {
                                if (cur_book >= numBooks()) cur_book = 0;
                                cur_sec     = (numBooks() > 0) ? bookSection(cur_book) : 0;
                                cur_chapter = 1;
                            }
                        } else if (cur_book >= numBooks()) cur_book = 0;
                    }
                }
                redrawSettingsContent();
                break;
            case SR_FONTSIZE:
                font_num = fwd ? (font_num == 1 ? 2 : font_num == 2 ? 4 : 1)
                               : (font_num == 1 ? 4 : font_num == 2 ? 1 : 2);
                writeScoped("font", font_num);
                redrawSettingsContent();
                break;
            case SR_FONTCOL:
                font_color_idx = fwd ? (uint8_t)((font_color_idx + 1) % FONT_COLOR_COUNT)
                                     : (font_color_idx == 0 ? FONT_COLOR_COUNT - 1 : font_color_idx - 1);
                writeScoped("fontcol", font_color_idx);
                redrawSettingsContent();
                break;
            case SR_VNUMCOL:
                vnum_color_idx = fwd ? (uint8_t)((vnum_color_idx + 1) % FONT_COLOR_COUNT)
                                     : (vnum_color_idx == 0 ? FONT_COLOR_COUNT - 1 : vnum_color_idx - 1);
                writeScoped("vnumcol", vnum_color_idx);
                redrawSettingsContent();
                break;
            case SR_THEME:
                theme_idx = fwd ? (uint8_t)((theme_idx + 1) % THEME_COUNT)
                                : (theme_idx == 0 ? THEME_COUNT - 1 : theme_idx - 1);
                dark_mode = THEMES[theme_idx].dark;
                writeScoped("theme", theme_idx);
                drawSettings();        // bg/fg all change — full repaint
                return;
            case SR_HIGHLIGHT: {
                // Option 0 = Default (theme colour); 1..ACCENT_COUNT = accents.
                uint8_t cur   = accent_def ? 0 : (uint8_t)(accent_idx + 1);
                uint8_t total = ACCENT_COUNT + 1;
                cur = fwd ? (uint8_t)((cur + 1) % total) : (cur == 0 ? total - 1 : cur - 1);
                accent_def = (cur == 0);
                if (!accent_def) accent_idx = cur - 1;
                writeScoped("accent",    accent_idx);
                writeScoped("accentdef", accent_def ? 1 : 0);
                redrawSettingsContent();
                break;
            }
            case SR_ORIENT:   // global (not scoped)
                orientation = fwd ? (uint8_t)((orientation + 1) % ORIENT_COUNT)
                                  : (orientation == 0 ? ORIENT_COUNT - 1 : orientation - 1);
                { Preferences mp;
                  if (mp.begin("menu", false)) { mp.putUChar("orient", orientation); mp.end(); } }
                applyOrientation();
                if (cached_count > 0) buildWrappedLines();
                menu_scroll = 0; scroll_px = 0.f;
                drawSettings();
                return;
            case SR_BRIGHT:   // global (not scoped)
                if (fwd) { if (bl_idx < 19) blSet(bl_idx + 1); }
                else     { if (bl_idx > 0)  blSet(bl_idx - 1); }
                redrawSettingsContent();
                break;
            case SR_BOOT:
                bootMarauder();
                return;
            case SR_CALIB:
#ifndef HAS_CAP_TOUCH
                runTouchCalibration();
                drawSettings();
#endif
                return;
        }
    }
}

void BibleInterface::handleBookmarksInput() {
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

    // ── Delete confirmation popup ─────────────────────────────────────────────
    // While the popup is visible, block all normal list input and only act on
    // a tap inside the Delete button (anywhere else = Cancel).
    if (bm_confirm_pending) {
        if (down && !touch_was_down) {
            touch_was_down = true;
            touch_down_x = tx;   // save position — pollTouch doesn't write tx/ty on lift
            touch_down_y = ty;
        } else if (!down && touch_was_down) {
            touch_was_down = false;
            // Recompute Delete button bounds (must match drawConfirmDelete)
            int16_t pop_w  = (int16_t)scrW() - 40;
            int16_t pop_y  = (int16_t)(scrH() / 2) - 40;
            int16_t btn_y  = pop_y + 44;
            int16_t btn_h  = 28;
            int16_t half_w = pop_w / 2 - 6;
            int16_t del_x  = 20 + pop_w / 2 + 2;
            // Use saved down-position — tx/ty are stale on lift (pollTouch returns false)
            bool in_del = ((int16_t)touch_down_x >= del_x && (int16_t)touch_down_x < del_x + half_w &&
                           (int16_t)touch_down_y >= btn_y  && (int16_t)touch_down_y < btn_y + btn_h);
            if (in_del && bm_sel >= 0 && bm_sel < (int16_t)bm_count) {
                for (uint8_t i = (uint8_t)bm_sel; i < bm_count - 1; i++)
                    bookmarks[i] = bookmarks[i + 1];
                bm_count--;
                if (bm_sel >= (int16_t)bm_count && bm_sel > 0) bm_sel--;
                saveBookmarks();
            }
            bm_confirm_pending = false;
            needs_redraw = true;
        }
        return;
    }

    // ── Finger just touched down ─────────────────────────────────────────────
    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;
        stopFling();
        drag_origin_px  = scroll_px;

        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            if (tx < scrW()/3) {
                goBack(); return;
            } else if (tx > 2*(scrW()/3)) {
                // "Del" — show confirmation popup
                if (bm_count > 0 && bm_sel >= 0 && bm_sel < (int16_t)bm_count) {
                    bm_confirm_pending = true;
                    needs_redraw = true;
                }
            } else {
                // "View" — navigate to the selected bookmark
                if (bm_count > 0 && bm_sel >= 0 && bm_sel < (int16_t)bm_count) {
                    jumpToBookmark((uint8_t)bm_sel);
                }
            }
            return;
        }
        // Highlight the touched bookmark immediately for press feedback
        int16_t hi = touchItem(tx, ty);
        if (hi >= 0 && (bm_scroll + hi) < (int16_t)bm_count) {
            bm_sel = bm_scroll + hi;
            redrawListContent(bm_count);
        }
        return;
    }

