H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    // Inform the user — this is a one-time scan that can take a few seconds
    tft.fillScreen(bg());
    tft.setTextColor(fg(), bg());
    tft.drawCentreString("Building index...", scrW() / 2, scrH() / 2 - 8, 2);
    tft.setTextColor(dim_fg(), bg());
    tft.drawCentreString("(first run only)", scrW() / 2, scrH() / 2 + 14, 2);

    if (book_offsets) memset(book_offsets, 0, (size_t)book_offsets_cap * sizeof(uint32_t));

    XmlState s;
    memset(&s, 0, sizeof(s));
    s.f = f;

    uint8_t  found     = 0;
    uint32_t tag_start = 0;
    bool     in_tag    = false;
    char     tag_buf[XML_TAG_BUF];
    int      tag_len   = 0;
    char     c;

    while (found < BIBLE_BOOK_COUNT && xmlNextByte(s, c)) {
        if (!in_tag) {
            if (c == '<') {
                // Record the absolute byte position of this '<'
                tag_start = (uint32_t)((int32_t)s.f.position()
                                       - s.chunk_len + s.chunk_pos - 1);
                in_tag  = true;
                tag_len = 0;
            }
        } else {
            if (c == '>') {
                in_tag = false;
                tag_buf[tag_len] = 0;

                // Skip closing / declaration / comment tags
                if (tag_buf[0] == '/' || tag_buf[0] == '?' || tag_buf[0] == '!') {
                    tag_len = 0;
                    continue;
                }

                // Only <verse ...> tags carry book information
                if (strncmp(tag_buf, "verse", 5) == 0 &&
                    (tag_buf[5] == ' ' || tag_buf[5] == '\t' || tag_buf[5] == 0)) {
                    char osis_id[64] = {0};
                    if (xmlGetAttr(tag_buf, "osisID", osis_id, sizeof(osis_id))) {
                        // osisID format: "BookCode.chapter.verse"
                        char* dot = strchr(osis_id, '.');
                        if (dot) {
                            int code_len = (int)(dot - osis_id);
                            for (uint8_t b = 0; b < BIBLE_BOOK_COUNT; b++) {
                                if (book_offsets[b] == 0 &&
                                    (int)strlen(bookCode(b)) == code_len &&
                                    strncmp(osis_id, bookCode(b), code_len) == 0) {
                                    book_offsets[b] = tag_start;
                                    found++;
                                    Serial.printf("[Bible] idx: %s @ %u\n",
                                                  bookCode(b), tag_start);
                                    break;
                                }
                            }
                        }
                    }
                }
                tag_len = 0;
            } else {
                if (tag_len < XML_TAG_BUF - 1)
                    tag_buf[tag_len++] = c;
            }
        }
    }

    f.close();
    Serial.printf("[Bible] Built index: %u/%u books found\n", found, BIBLE_BOOK_COUNT);
    return (found > 0);
}

void BibleInterface::saveBookIndex(const char* stem) {
    // Embed the current XML file size so we can detect if it gets replaced
    char xml_path[64];
    snprintf(xml_path, sizeof(xml_path), "%s/%s.xml", basePath(), stem);
    File fx = SD.open(xml_path);
    if (!fx) return;
    uint32_t xml_size = (uint32_t)fx.size();
    fx.close();

    char idx_path[64];
    snprintf(idx_path, sizeof(idx_path), "%s/%s.idx", basePath(), stem);
    SD.remove(idx_path);   // overwrite any stale index
    File fo = SD.open(idx_path, FILE_WRITE);
    if (!fo) return;

    uint32_t magic = 0x42494458UL;
    uint32_t ver   = 1;
    fo.write((uint8_t*)&magic,       4);
    fo.write((uint8_t*)&ver,         4);
    fo.write((uint8_t*)&xml_size,    4);
    fo.write((uint8_t*)book_offsets, BIBLE_BOOK_COUNT * sizeof(uint32_t));
    fo.close();
    Serial.printf("[Bible] Saved index: %s\n", idx_path);
}

// ─────────────────────────────────────────────────────────────────────────────
// Brightness
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::blInit() {
    // Brightness is GLOBAL (one value for the whole firmware), stored in the "menu"
    // namespace regardless of which mode adjusts it.
    bl_idx = 10;
    { Preferences mp; if (mp.begin("menu", true)) { bl_idx = mp.getUChar("bright", 10); mp.end(); } }
    if (bl_idx >= 20) bl_idx = 19;
#ifndef HAS_MINI_SCREEN
  #if ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcAttach(TFT_BL, 5000, 8);
    ledcWrite(TFT_BL, BL_LEVELS[bl_idx]);
  #else
    ledcSetup(0, 5000, 8);
    ledcAttachPin(TFT_BL, 0);
    ledcWrite(0, BL_LEVELS[bl_idx]);
  #endif
#else
    pinMode(TFT_BL, OUTPUT);
    digitalWrite(TFT_BL, HIGH);
#endif
}

void BibleInterface::blSet(uint8_t idx) {
    if (idx >= 20) idx = 19;
    bl_idx = idx;
    { Preferences mp; if (mp.begin("menu", false)) { mp.putUChar("bright", bl_idx); mp.end(); } }
#ifndef HAS_MINI_SCREEN
  #if ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcWrite(TFT_BL, BL_LEVELS[bl_idx]);
  #else
    ledcWrite(0, BL_LEVELS[bl_idx]);
  #endif
#endif
}

void BibleInterface::blCycle() {
    blSet((bl_idx + 1) % 20);
}

// ─────────────────────────────────────────────────────────────────────────────
// Battery gauge — MAX17048 direct I2C register access (no external library)
// Register 0x04 = SOC: high byte = integer %, low byte = 1/256 % (discarded)
// ─────────────────────────────────────────────────────────────────────────────
#ifdef HAS_BATTERY
void BibleInterface::battInit() {
#ifndef HAS_CAP_TOUCH
    // Cap-touch boards already called Wire.begin() in ft6336_init()
    Wire.begin(I2C_SDA, I2C_SCL);
#endif
    Wire.beginTransmission(0x36);
    batt_ok  = (Wire.endTransmission() == 0);
    batt_pct = -1;
    if (batt_ok) {
        battUpdate();
        Serial.println(F("[Battery] MAX17048 OK"));
    } else {
        Serial.println(F("[Battery] MAX17048 not found"));
    }
}
void BibleInterface::battUpdate() {
    Wire.beginTransmission(0x36);
    Wire.write(0x04);   // SOC register
    if (Wire.endTransmission(false) != 0) { batt_ok = false; return; }
    Wire.requestFrom((uint8_t)0x36, (uint8_t)2);
    if (Wire.available() < 2) return;
    uint8_t hi = Wire.read();
    Wire.read();  // fractional byte — discard
    batt_pct = (int8_t)((hi > 100) ? 100 : hi);
    batt_ms  = millis();
}
#endif

// ─────────────────────────────────────────────────────────────────────────────
// Search — touch helper
// ─────────────────────────────────────────────────────────────────────────────
bool BibleInterface::touchInSearchIcon(uint16_t x, uint16_t y) {
    if (y >= hdrH()) return false;
    // Button spans scrW()-63 to scrW()-35 (28px wide, matches drawHeader)
    int16_t sb_x = (int16_t)scrW() - 63;
    return ((int16_t)x >= sb_x && (int16_t)x < sb_x + 28);
}

// ─────────────────────────────────────────────────────────────────────────────
// Search — navigation helpers
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::goToSearchInput() {
    stopFling();
    search_del_pending = false;
    view            = BV_SEARCH_INPUT;
    search_hist_sel = 0;
    menu_scroll     = 0;
    scroll_px       = 0.f;
    needs_redraw    = true;
}

void BibleInterface::goToSearchResults() {
    stopFling();
    view           = BV_SEARCH_RESULTS;
    search_res_sel = 0;
    menu_scroll    = 0;
    scroll_px      = 0.f;
    needs_redraw   = true;
}

// ─────────────────────────────────────────────────────────────────────────────
// Search — draw views
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::drawSearchInput() {
    tft.fillScreen(bg());
    if (mode == MODE_DICT && trans_count > 0) {
        // Header shows the active dictionary; tapping it (centre) cycles to the next.
        String nm = trans_stems[cur_trans]; nm.toUpperCase();
        char title[40];
        snprintf(title, sizeof(title), "Search: %s", nm.c_str());
        drawHeader(title, true);
    } else {
        drawHeader("Search", true);
    }

    if (search_hist_count == 0) {
        tft.setTextColor(dim_fg(), bg());
        tft.drawCentreString("No search history", scrW() / 2, contentY() + 30, 2);
        tft.setTextColor(dim_fg(), bg());
        tft.drawCentreString("Tap  New  to search", scrW() / 2, contentY() + 56, 1);
    } else {
        uint8_t vis = visItems();
        for (uint8_t i = 0; i < vis && (menu_scroll + i) < search_hist_count; i++) {
            bool sel = ((menu_scroll + i) == (uint8_t)search_hist_sel);
            drawListRow(contentY() + i * itemH(), search_hist[menu_scroll + i], sel, false);
        }
        drawScrollBar(search_hist_count, vis, menu_scroll);
    }
    drawNavBar("New", "View", "Del");
    if (search_del_pending) drawSearchDelConfirm();
}

